[{"id":1,"idUsuario":1,"titulo":"Segunda Guerra Mundial","contenido":" Segunda Guerra Mundial fue un conflicto militar global que se desarrollo entre 1939 y 1945.","idCategoria":3,"imgSrc":"guerra.jpg","comentarios":[{"idUsuario":1,"comentario":"Ese es un Juego"},{"idUsuario":2,"comentario":"Malditos Nazis"},{"idUsuario":3,"comentario":"Porque no naci en esa epoca?"}],"fecha":"2017-10-30","puntuacion":4},{"id":2,"idUsuario":2,"titulo":"Reseña de la película It","contenido":"Una de las películas más esperada de este año, mmmm, que digo este año, una película muy esperada desde hace mucho tiempo, es la nueva versión cinematográfica de la gran novela de terror de Stephen King, It, una historia fascinante sobre miedos, amistad y evolución; después de una exitosa miniserie en los noventas, ahora, muchos años después Warner Bros. Pictures revive este clásico de la literatura, que además se hizo una película de culto, hoy tenemos la oportunidad de revivir esta espeluznante historia con mejores efectos y un Pennywise más atemorizante, o eso es lo que nos prometen, una historia de terror que te volará la cabeza.\r\n\r\nAhora, debo decir, que después de todo el gran revuelo y alboroto por esta cinta, después de todo lo que había leído, después de que las primeras personas salieron de las salas de cine y dijeron “brillante, magnifica, la mejor historia de terror”, la verdad es que yo subí muchísimo mis expectativas, además, no por nada la taquilla de esta cinta está haciendo historia, algo detrás de la película Eso la debe hacer la mejor cinta de terror de la historia, la mala noticia, es que no es así, si bien es entretenida, la ambientación es buena, creo que esta adaptación se pierde de cosas esenciales en la historia, eso sí, los efectos especiales son notoriamente mejores en esta nueva versión, pero en la miniserie de los noventas, creo yo, hay más elementos importantes y fundamentales de la historia.\r\n\r\nCreo que esta cinta está bien, es entretenida y es para un público joven, pero de eso a decir que es la mejor película de terror del mundo, hay un gran mundo, y el terror que despertó la miniserie en los noventas, ya no lo podrá replicar este remake y creo que mi mayor queja es que, mucho del arte, mucho de los espectros y sustos que se usan para asustar a los niños del club de los perdedores, están muy relacionados con otras historias de terror, estos “demonios” me recordaron mucho al arte que vimos en el Conjuro, creo que James Wan definitivamente marco el cine y ahora vemos esa visión de fantasmas y demonios, en todos lados, inclusive en la película Eso.\r\n\r\n\r\n \r\nEsta cinta creo que está muy lejos del terror y suspenso de la historia original, y más bien se centra en el género de los sustos y otra cosa que me pareció bastante pobre, es que la cinta no se centra en contarnos la historia de amistad que genera el club de los perdedores y el cómo se dedican a investigar el misterio de Derry, que se lee en el libro; nuevamente quedan fuera de esta impresionante historia piezas claves como la ayuda de la tortuga Maturin, el ritual de Chud, en fin, se dejan de lado fundamentos claves de esta película y se centra más en los sustos que reciben los niños.\r\n\r\nY a pesar de que solo hay sustos en esta historia, la cinta es larga; ahora, si existen algunos elementos del libro en esta adaptación, pero creo que se quedó muy corta y no es la gran historia de miedo, que me habían vendido el capítulo uno de Eso.\r\n\r\nTal vez mi gran problema con la película Eso, es que esperaba la mejor cinta de terror, cuando no es así y la han inflado demasiado, si vas pensando que es una película más de sustos, tal vez te parezca una película más de este género.\r\n\r\n¿La mejor?, ¿el mejor Pennywise del mundo?, ese ya es un debate que generara mucha polémica, pero yo te digo, que a mí me pareció larga, cansada y tenía altas, muy altas expectativas que chocaron con la realidad.","idCategoria":4,"imgSrc":"59f91c814e7bf5.80226566.jpg","comentarios":[],"fecha":"2017-10-31","puntuacion":0},{"id":3,"idUsuario":3,"titulo":"El Salvador","contenido":"El Salvador, oficialmente República de El Salvador, es un país soberano de América Central ubicado en el litoral del océano Pacífico con una extensión territorial de 21 041 km².1​ En el año 2015 contaba con una población estimada en 6 521 0006​habitantes, siendo el país más densamente poblado del continente americano. Su clima es cálido tropical. El Salvador limita con Guatemala al oeste y con Honduras al norte y al este, al sureste el golfo de Fonseca lo separa de Nicaragua, y flanqueado al sur por el océano Pacífico. Su territorio está organizado en 14 departamentos, 39 distritos y 262 municipios.7​ La ciudad de San Salvador es la capital del país; su área metropolitana incluye 14 municipalidades cercanas, y concentra la actividad política y económica de la república. Las ciudades de Santa Ana y San Miguel son otros centros importantes del país.\r\n\r\nEl actual territorio de El Salvador comprende lo que antes fuera la Alcaldía Mayor de Sonsonate y lo que fue la Intendencia de San Salvador que conformó la mayor parte del territorio. Ambas provincias adquirieron su independencia de España en 1821 junto a la Capitanía General de Guatemala y en 1824 se unieron para formar el «Estado del Salvador»,8​ como parte de la República Federal de Centro América. En la época precolombina, existía un importante núcleo indígena conocido como el Señorío de Cuzcatlán (que en lengua náhuat significa ‘lugar de joyas’ o ‘lugar de collares’).9​\r\n\r\nUna guerra civil de 12 años, cuyo costo humano llegó aproximadamente a 75 000 vidas, finalizó el 16 de enero de 1992, cuando el gobierno y la guerrilla firmaron los acuerdos de paz que dieron lugar a reformas militares, sociales y políticas.","idCategoria":1,"imgSrc":"59f91e7114f5f0.08513756.jpg","comentarios":[],"fecha":"2017-10-31","puntuacion":0},{"id":4,"idUsuario":2,"titulo":"Café Albania El Salvador","contenido":"Un laberinto formado por más de 2,000 árboles de ciprés es el ancla principal de Café Albania, un negocio creado en una finca cafetalera de seis manzanas de terreno ubicada en el municipio de Apaneca, al occidente del país.\r\n\r\nEl negocio abrió sus puertas al público el mes pasado, con una inversión de 30 mil  dólares.\r\n\r\nEl laberinto de 2,000 metros cuadrados comenzó a cobrar forma hace 10 años, cuando Mauricio Arévalo, propietario de la finca, hizo los primeros trazos y sembró el primer ciprés, con ayuda de sus empleados.\r\n\r\n“Mi idea era prepararme para un futuro, aprovechando el potencial turístico de la propiedad, tanto por la vista, la ubicación y la forma del terreno”, comentó Arévalo.\r\n\r\nLos sueños del empresario se aceleraron cuando los bajos precios internacionales del café, y las plagas –como la roya– golpearon al sector.\r\n\r\n“Hoy día es bastante común que el cafetalero migre de la producción al sector de servicios, como restaurantes y cafés, entre otros. En Guatemala, por ejemplo, hay muchos que están migrando al rubro de la energía eléctrica”, expresó.\r\n\r\nLa apuesta por el turismo, según Arévalo, es que es un sector más dinámico, en donde el dinero fluye más, mientras que el café es un negocio que brinda beneficios una vez al año y está expuesto más al cambio climático.\r\n\r\nEsa realidad permitió que hoy día Arévalo ofrezca el servicio de sano entretenimiento con el laberinto que considera “el más grande de Centroamérica”, según un rastreo hecho por su persona.\r\n\r\nLos visitantes que quieren disfrutar de la aventura –considerada de dificultad alta–deben cancelar 3 dólares (los niños pagan 2 dólares).\r\n\r\nLos que prefieran pueden quedarse en la terraza del café degustando de un típico café de olla o exprés, atoles, o la comida rápida que ofrece el nuevo negocio. También hay área de juegos infantiles y jardines.\r\n\r\nExpansión\r\n\r\nPara finales de 2018, el empresario planea expandir el negocio hacia el servicio de estadía.\r\n\r\nEl proyecto es edificar 10 cabañas, las cuales tendrán diversas formas de construcción. Algunas serán hechas con contenedores, madera, y otras serán tipo iglú. La inversión inicial se estima en 100 mil dólares.\r\n\r\nComo un valor agregado, el empresario proyecta construir en un mediano plazo pequeñas cabañas de madera para la venta de productos netamente salvadoreños. Las cabañas serán rentadas a emprendedores.","idCategoria":7,"imgSrc":"59f91eb14ffe85.84929306.jpg","comentarios":[],"fecha":"2017-10-31","puntuacion":0},{"id":5,"idUsuario":1,"titulo":"Conociendo Arduino","contenido":"Arduino. A poco que hayas navegado por internet te habrás encontrado esa palabra. Y es que ahora que es posible automatizar cualquier cosa, para hacer agentes autónomos (si queréis llamarles Robots también), controlar luces y dispositivos, o mil cosas que se os pueda ocurrir fabricar podéis optar por una solución basada en Arduino, una familia de placas y software que comparten nombre pero que son legión.\r\n\r\nAlgunas placas Arduino\r\nEmpezamos por el principio y despacio, por favor. ¿Qué es exactamente Arduino?\r\n\r\nNo es la primera vez que hablamos sobre Arduino en Xataka, pero como es verano y da pereza eso de ir saltando de enlace en enlace vamos a verlo todo desde el principio. Arduino es una plataforma de electrónica \"open-source\" o de código abierto cuyos principios son contar con software y hardware fáciles de usar. Es decir, que promete ser una forma sencilla de realizar proyectos interactivos para cualquier persona. Y cuando digo cualquiera, es cualquiera, ya que internet está literalmente plagado de proyectos con Arduino, como veremos más adelante.\r\n\r\nComo digo, Arduino es tanto software como hardware, y aquí viene la primera diferencia con otras placas y microcontroladores. Los entornos de desarrollo y lenguaje de programación de Arduino y las placas en las que se ejecutan han sido desarrollados de la mano, por lo que tenemos asegurada tanto la compatibilidad como la sencillez de desarrollo sobre ellas.\r\n\r\nIDE de Arduino\r\nSoftware Arduino\r\n\r\nSi nos centramos en el software, debéis saber que contamos con un IDE para casi todas las plataformas (Windows, Linux, Mac). ¿Y qué es un IDE? Bueno, son las siglas de Integrated Desktop Development Environment, o entorno de desarrollo integrado en cristiano. Un lugar donde podemos escribir nuestras aplicaciones, descargarlas al Arduino y ejecutarlas o depurarlas desde allí. El entorno de desarrollo es gratuito y descargable desde aquí. En resumen, el proceso pasa por descargarnos e instalar el IDE correspondiente a nuestra plataforma, trastear un poco siguiendo los tutoriales o simplemente hacer \"corta y pega\" del código que nos interese (aunque esto realmente es como desvelar el final de una buena película, es decir, que tiene poca gracia) y ya tenemos gran parte del trabajo hecho. O al menos en cuanto a software, porque la gracia de Arduino es precisamente la interacción del software con el hardware.\r\n\r\nAprender el lenguaje de programación es sencillo, sobre todo si ya tienes experiencia en otros lenguajes de programación como C o Java ya que Wiring \/ Processing para su programación se basa en ellos. El microcontrolador en la placa Arduino se programa mediante el lenguaje de programación Arduino (basado en Wiring) y el entorno de desarrollo Arduino (basado en Processing). Tienes más información sobre el mismo aquí.\r\n\r\nHardware Arduino\r\n\r\nY ahora hablamos de hardware. Hay infinidad de placas basadas en Arduino. Como os decía, es hardware \"Open-source\", así que cualquiera que quiera hacer una placa puede hacerlo. Y por ello tenemos Arduino de todos los colores, tamaños y con funciones propietarias de lo más diverso, y también productos que sin ningún pudor están basados en Arduino para controlar a su vez distintos dispositivos, integrados en el producto o no.\r\n\r\nVolvamos al principio. El hardware Arduino más sencillo consiste en una placa con un microcontrolador y una serie de puertos de entrada y salida. Los microcontroladores AVR más usados son el Atmega168, Atmega328, Atmega1280, y Atmega8 por su sencillez y bajo coste que permiten el desarrollo de múltiples diseños, aunque también nos encontramos microcontroladores CortexM3 de ARM de 32 bits,5 que coexistirán con las más limitadas, pero también económicas AVR de 8 bits. ARM y AVR son plataformas diferentes, pero gracias al IDE de Arduino los programas se compilan y luego se ejecutan sin cambios en cualquiera de las plataformas. Corrección: Nuestro Lector fr0gdev nos comenta que hay ciertos problemas de compatibilidad de librerías entre plataformas, así que habrá que tenerlo en cuenta a la hora de elegir placa Arduino.\r\n\r\nArduino Mega\r\nLa diferencia entre los distintos Arduino la encontraremos por un lado en la tensión utilizada en las placas. Generalmente las microcontroladoras con CortexM3 tienen un voltaje de 3,3 voltios, mientras que la mayor parte de las placas con AVR utilizan una tensión de 5 voltios. Esto luego es fundamental para utilizar lógica TTL (frente a lógica CMOS) por ejemplo, lo que abre la posibilidad de utilizar chips baratos y complementar el Arduino con alguna funcionalidad externa. También hay placas que pueden conmutar el voltaje, así que tampoco es un factor determinante para seleccionar una placa u otra. Y, por otra parte, el número de conexiones, procesador utilizado, memoria y, sobre todo, el número de entradas y salidas y la posibilidad de alimentar distintos elementos desde la propia placa Arduino.\r\n\r\nHay placas que incluso no necesitan drivers para Linux o para Mac, como las basadas en el chip ATmega8U2 (un ejemplo es el Tosduino Uno R3), siendo detectado por dichos ordenadores como un periférico más.\r\n\r\nVale, ¿para qué sirve Arduino?\r\n\r\nArduino se puede utilizar para desarrollar elementos autónomos, o bien conectarse a otros dispositivos o interactuar con otros programas, para interactuar tanto con el hardware como con el software. Nos sirve tanto para controlar un elemento, pongamos por ejemplo un motor que nos suba o baje una persiana basada en la luz que haya y gracias a un sensor conectado al Arduino, o bien para transformar la información de una fuente, como puede ser un teclado, y convertir la información a algo que entienda por ejemplo un ordenador.\r\n\r\n\r\nAsí, podemos catalogar los usos que podemos darle a Arduino en dos grandes grupos:\r\n\r\nAquellos en los que el Arduino es utilizado como microcontrolador, tiene un programa descargado desde un ordenador y funciona de forma independiente de éste, y controla y alimenta determinados dispositivos y toma decisiones de acuerdo al programa descargado e interactúa con el mundo físico gracias a sensores y actuadores. Un ejemplo sería este uso de Arduino para el control de este agente autónomo que sigue una línea:\r\n\r\nLa placa Arduino hace de interfaz entre un ordenador (como podría ser una Raspberry Pi) u otro dispositivo , que ejecuta una determinada tarea, para traducir dicha tarea en el mundo físico a una acción (actuadores). Y viceversa, gracias a sensores que están conectados a la placa Arduino podemos hacer que el ordenador ejecute determinada acción. Por ejemplo esta placa de Pimoroni para simplificar la creación de un cabinet de videojuegos:\r\n\r\n\r\nEn Xataka ya hemos visto unos cuantos ejemplos de proyectos con Arduino, y como veis todos ellos pertenecen a una de las dos categorías anteriores.\r\n\r\nOs dejo otro proyecto para que podáis comprobar una posibilidad interesante para ser usado en un vehículo como ordenador de a bordo y con sensores de aparcamiento.\r\n\r\n\r\nHablemos de placas Arduino y de sus famosos escudos o mochilas (Shields)\r\n\r\n¿Que quieres un poco de Arduino? Pues ahí tienes unas cuantas placas por donde empezar y elegir. Como podéis ver en el gráfico anterior, tenemos placas más sencillas, placas Arduino con características mejoradas, Arduino orientado al internet de las cosas, y también Arduinos pensados para llevar encima o \"vestibles\" (Wearable en inglés) y otros pensados específicamente para el control de impresoras 3D. Vamos, que si pensabas que Arduino era una placa y que había poca variedad donde elegir, ...\r\n\r\nFamilia de hardware Arduino\r\nY si las placas Arduino son numerosas, más todavía lo son sus escudos o mochilas (Shields), tan importantes como el escudo del Capitán América para el superhéroe de Marvel. Gracias a los shields podemos contar con infinidad de funciones, como GPS, relojes en tiempo real, conectividad por radio, pantallas táctiles LCD, placas de desarrollo, y un larguísimo etcétera de elementos. Incluso hay tiendas con secciones especializadas en dichos elementos.\r\n\r\nEjemplos de shields Arduino \r\nVenga, ya me has convencido. Ahora, ¿Por dónde empiezo?\r\n\r\nPara empezar a hacer nuestros pinitos con Arduino tenemos que tener claro qué queremos hacer. Existe una infinidad de fuentes en Internet de las cuales beber y ampliar conocimientos. Para rizar el rizo, con la cantidad de placas Arduino existentes y su especialización debemos saber qué queremos hacer antes de comprar en caso de proyectos más complejos. Para obtener una lista completa casi lo mejor es ir a la Wikipedia y ver todos los modelos existentes, o evidentemente ir a su página oficial.\r\n\r\nArduino UNO R3\r\nPara simplificaros los primeros pasos, lo normal es ir hacia una placa sencilla. El modelo más utilizado es el Arduino UNO r3, o al menos el que más veréis en proyectos de internet. Tiene un buen número de entradas y salidas y probablemente estaréis más que contentos dando vuestros primeros pasos con dicha placa.\r\n\r\nSi por el contrario ya sabéis algo, habéis enredado lo suficiente y\/o necesitáis controlar un buen número de motores, motores paso a paso, hacer una impresora 3D, ... lo suyo es ir a un Arduino MEGA r3, aunque luego para rizar el rizo podemos utilizar un Arduino Uno y un controlador de múltiples servomotores, como por ejemplo en este proyecto de un original reloj digital en 3D.\r\n\r\nWearables creados con controladores Arduino\r\nA lo mejor queréis fabricar un dispositivo \"vestible\", algo que consuma poca energía y que tenga un uso determinado, para ello nada mejor que optar por una placa mini. Prestad especial atención a las placas ofrecidas por Adafruit en esta categoría, ya que tienen auténticas \"virguerías\" y una buena cantidad de tutoriales para hacer cosas tan chulas como control de led multicolores para llevar encima, cascos para ciclistas y mil cosas más.\r\n\r\nSi queremos simular la programación de un Arduino, podemos hacerlo gracias a VirtualBreadBoard, un entorno de simulación y desarrollo de aplicaciones embebidas para microcontroladores. Es capaz de simular diverso hardware, como Arduino, Netduino, botónes, LCDs, etc.\r\n\r\n\r\nOtra recomendación, si lo que queréis es hacer un proyecto que integre Arduino con Robótica, Makeblock tiene unos excelentes kits de desarrollo y todas las piezas habidas y por haber para hacer dichos proyectos. Es más, podéis hacer desde impresoras 3D, grabadoras láser, plotters, robots, etc. con unas piezas de una calidad asombrosa y fabricadas en aluminio y placas Arduino Leonardo.\r\n\r\nY la última recomendación, comparad precios y buscad también en tiendas \"chinas\" para la adquisición de elementos en internet. Hay una gran diferencia de precios y si no os importa esperar un poquito más en el envío podéis ahorraros bastante dinero. ","idCategoria":5,"imgSrc":"59f920c7a78fe6.86947767.png","comentarios":[],"fecha":"2017-10-31","puntuacion":0}]